person = int(input('Введите количество гостей: '))

cook_book = [
  ['салат',
      [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
      ]
  ],
  ['пицца',
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],
      ]
  ]
]

for meal in cook_book:
  print(f'\n{meal[0].capitalize()}:')
  for ingredients in meal[1:]:
    for product in ingredients:
      for i in range(len(product)):
        if i == 0:
          print(f'{product[i]}, ', end='')
        elif i == len(product)-1:
          print(product[i])
        else:
          print(f'{person * product[i]:,}', end='')